{
  "alpha_pattern": {},
  "auto_mapping": null,
  "base_model_name_or_path": "roberta-base",
  "beta1": 0.9,
  "beta2": 0.999,
  "bias": "none",
  "deltaT": 11191,
  "eva_config": null,
  "exclude_modules": null,
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "init_r": 11,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 16,
  "lora_bias": false,
  "lora_dropout": 0.15,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": [
    "classifier",
    "classifier",
    "score"
  ],
  "orth_reg_weight": 0.5,
  "peft_type": "ADALORA",
  "r": 8,
  "rank_pattern": null,
  "revision": null,
  "target_modules": [
    "value",
    "query"
  ],
  "target_r": 8,
  "task_type": "SEQ_CLS",
  "tfinal": 11190,
  "tinit": 0,
  "total_step": 11190,
  "use_dora": false,
  "use_rslora": false
}